app/controllers/api/businesses_controller.rb

SELECT "businesses".* FROM "businesses"
---
  def index

    @businesses = if params[:tag].present?
                    Business.joins(:tags).where(tags: { tag: params[:tag] })
                  else
                    Business.all