backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def test
    if params.has_key?(:login)
      login!(User.find_by_id(12))