backend/app/controllers/api/businesses_controller.rb

  def index

    @businesses = Business.all
---
SELECT "businesses".* FROM "businesses"